const config = {
    // storageKey: це ключ, який буде використовуватися для зберігання даних кошика у локальному сховищі.
    // Це дозволяє ідентифікувати, де саме в локальному сховищі браузера зберігається інформація про товари, додані в кошик.
    storageKey: 'cartAdded',

    // storageCartVisibility: це ключ для зберігання стану видимості кошика.
    // Це може бути використано для збереження інформації про те, чи повинен кошик бути видимим чи прихованим у користувацькому інтерфейсі.
    storageCartVisibility: 'cartVisibility',
};

export default config; // Експорт об'єкта config для його використання в інших частинах додатку.
